#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "07f834cb6227fe085b553930003bb5de" -> "8bc21f9650e78f3c84ac8dfe58c732e5"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "aa75907c18e421b4ceccba3de1d6c7ae" -> "a7e7905fa39424f25e665542ca65e231"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bdc7713041da0068c12978d436d66803" -> "4e0f983ac6477f190c40aaa1e62b2480"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "453e4384c736fa1797d4438e122bbf71" -> "730afdf497719cd6ef9b49c4427342bd"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "2d7bcd3117c5a158f2a8b5b902d7a7ff" -> "4a66959e036b13e271eacfd72be870c6"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a9b24088629c5aa5a588e451965ed616" -> "ccc6197b8fd2227341defb498dcab822"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e959a9c9461fcefec688df50db184ae9" -> "1603f994fab2a4279c55071e24967be6"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "bbc72e87c03b5d8fa5c1f7b98f81d8c6" -> "81baef5328ec8ce40b6ae339aa3ce6b8"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a19cd238838913055f074a41b949e872" -> "118e4dbda7840087f1312f4339d27cd8"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "601ff53a29a4e23d68d01161340436ac" -> "7389d89079b102a23e201d09dc2a331c"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "8d259c495fe20b773fd78167aae6cb8d" -> "78cf535c051523695354530ae53bbc72"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "7c7a5708cd1f541f77db2e6e2fc527cb" -> "7e5eebc1e7f2fe8a2d410af87769b46a"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "d1a17e0fab4c38041a8f468d97251217" -> "5c543ce103924a9679532bc196fdf936"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "09f0d2410641ad2d3fbf33ef3417c8b3" -> "7005c35e5a0db3e8b4b8bbc7d7a20a47"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f3f6c5665297d31021033353f1f955bb" -> "46853bd9eb3eb7ea24d5a2ecc7b82270"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e9652ab12003c7f37ce5b9ce079bfb7b" -> "334c88cc00268ecae7dd331d37c6d563"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "e61137c0a52c4c8bf97273e6b68618dd" -> "6061f3cd0bda68126ad5202fe58eb363"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "bfe60566e68821c87ec1124c3b60ac15" -> "cc3c7d62e061ef4388d248f682c52a31"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "83d7e39948a32745c3e00acfa81f0775" -> "d1bcfc123e9d8776ce810ba9b915713f"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e4131bd38321bcc8dae9b4b2d9ae606e" -> "a1e0bbdb94669b772d89b8488ae3bb63"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c1c2b6d8fb2fe63a419fb344fb14543d" -> "cd4b1623d849b5e337cc6e390c46af21"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "9e7953263f48b90be8c58ee4a39c66f8" -> "bdaf61cf74c4ef9105d25355aa09f9e0"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "2f8c370c7f6c89ad51dbbc9bede93fdc" -> "ce167f8e16a5c0d59d3b38a7960cec7b"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "7d9f0191effde14274151ee9a62a55b7" -> "5b39fbedd4586d084ba814a4eca16ac0"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "8c7e59b21f5137167371e416dd60d597" -> "9e24ad70319d37161562af6f9a2bde19"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "cd0034257356293578248885a6547dcf" -> "19b6f35128208c878df2e0e7f592de99"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "8d5bd82bb8566de2dda53e4b84b423dd" -> "5fed1c5f3da66e205647ca67c214754d"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "15bf5b42b757fbfdd79dd7e3a6aa1f20" -> "f4c98e180317fa95032a6bc703f5acbb"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "99b177d1995b2054bb58617041baed0f" -> "05fdaae10b089bed9aea119ba42c6569"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "02db5f86ea9e7a678eeebe5985c1b259" -> "9e71964d8b217d3c80cbb6b37c70c8d9"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b7093c5e3a021ef9e61f7a0db6d2fcae" -> "5fc14efa43aad70f84196004e17dc41f"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c151674dbcbc1a085261b37fe21088ab" -> "3918f93c2a6fb620fb692736b267ce9d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f07b32129180eeef032d2b636c69946d" -> "1948c40503d5fa28e9b7d48af94753eb"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6ddef67d1582f24ac0d020bc9e72449f" -> "b2e6152cb0fa25804657b24f6dff8ea8"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "cfad19a9cf91b2abfc82eeb317eee8b6" -> "faa0eab286ce17dd2d1f227ae3da168e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "adcfc5e29eb180df64d8210b6fcfdbc6" -> "63d0f2c4ce1e10eac08527aae60e3bb0"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "22ee05ebfc08eaee8eeb2175b39642c7" -> "87233704519fae8df1d5f095952fcb71"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bb85a9370091b0bbfb6175ff268d645e" -> "32fccfb0ef45a7a2a8189cfc86e0cc57"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "5b02798322bddf80bb154e29612e1c7f" -> "21da02731d62a22a52a69b83d65f7216"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "ef43aac585b580c5ee4e070f21af1075" -> "487fe3cb28a97d52b66b5d070f709b9b"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d651b0c4cc267bef137b713a943f1d8e" -> "b1603bd63f23d4a12c2ca2e1484306cc"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "65a1007208faa96bf93d944edf2bfd8c" -> "ec53b2b216bb1c9b4bce2c4eacc3eede"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "71e532075095176ed11332ee8e48a5d1" -> "296921aa0bc7cf612edcdb098e06f658"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "8237ed4cbdcea80791bc7a8e089695d2" -> "708f91b8927bbc3aa4b1f6796f2bb9ac"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "c5d79fb3a93aa39fa3e47425eb0b5eeb" -> "dd5f65e39f96ac125d6d699073e48dce"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "3f7df2c9ee5178e4fec54698e058e708" -> "0e0fe550c59068fef426fffc5fd42487"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "MS755qiXjgLVP+X+yFaB6a6xhoLmcUDtI/UksKzmeSg=" -> "umko+ZFM30yyviWlax9o0hy2CVx2kqdP0Lzgyr6pVjY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "t5PB/tKfdAJPBOiaHJm2VIYXg2IzGFdfRukyTVsFcSw=" -> "e/ymxr1D0aEyMTDLfLjRVIpYF5cw7i7mJ4MxFdjs6/A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "EP1oOpdzjoaLVYylnauLPCuOVrInJRIg8S74ctePKwA=" -> "A688D+ihRPwT+XTJSlI7tIK+mfTzaCZm6ggezIVKGvs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVgtuNDjZB00+7LZihhItd15GCOq3HDhtt42Owngscw=" -> "8cfqReHqMkEXiwBWIoHUdfcW93XbMmAFk0uEu8mMJb8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "4+jMLJEK5h+0ZUdCWirqhVXZzNvdObpXQHZgn69gejM=" -> "ePb7KKCPtdqbUDkvpai7Fyy0hEE61M7uGVTfXFMJ0dw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "q37c5Wmgq84RePz6v9QkhEVuNOg4NndYVQLOTQsPD1o=" -> "vLXwIroWYn0Jso246ecxXj3gifYQcPiTV53c5Po154s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "uufMUu2rMzYQGZrYWf/GcZ7G2CXnPDSybSVnIUzWLEg=" -> "aUVs4vrVLGc2BF9s0YdmZ5+GMrf0v9kW7i3ikWV51Ew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BzTlkL5pvC4B8zXVE32MGz2VD2SdznqZjhhcoKnInNo=" -> "3iyIpADA2IhWbOiHLrJZlM9/QDz9mqF8yByPmCwTBqw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgpBSWXxx2bgVRmUWMd8VPvq9AACWnxQQGBBxvYl+iY=" -> "2227rUJjLG+P0XBsUHswYKmUb+MVwVyHAVuwNUa7JKc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "JsMhorwkj2ryJ3WvNhmO1Xwc4n2onciSdNKmVED8cxg=" -> "3T8yoqm9BsGW+Th2QYShaQ9JM565w4xj0BNg/t7KDAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "NTgs+EyV/uC7GAH+q5N6iXEjaOl7VsLmVCjie7TIZts=" -> "PKnf2qWonXp6xYw1IUcM0nSKPbTHqHziikh796LcLRM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FuEnSMwco8rGsBlmHZEKCBWYDtGopyQIdiy6j/0foQI=" -> "gm2JvOg22hGiOLJOD66lgDa4UTaFe0+Uyr62/R+yLXs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "ttHHWOjEmrp31tuMIbhutFvmN4CS11e2hegvfoMRpLM=" -> "7qdzQTX+C3Skfa2Nqk1JOsz8bwVRJnE20vR4nS4Du+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMZLwZlG1PaQPeG4/HRaT4o1W4wGjNqL/of2+xyxgR4=" -> "dp6Eblt+cOMUeby8rBgxCutSygDtZ3studPcCqgXKrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "+uaM3gisk85HGF3LIIjsl0tmLxIQSdvcU0yj8/G2RBE=" -> "yqh3rShnlKv0SPFwORhkIXcwyumRA1R7NPMxsXGlJws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "JQ4HpohmMzVKwIikH2oBswNW/c3W3d42GuSDfXgflfU=" -> "0cRxli2hKnfh+NRI4WE3gP0IUMbqqnkVDuSLaslyCPw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "qbxcaFqfw4wkF/nOtxN6GdS3mUmI8u+5u4obaEY+0Dg=" -> "fy1Odd5nmF44SMStl9vCUZ5dPAMddwuS+jAcAm1c8Z0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKGaLAeQWRKB7AFl3ksz/3unRswGmvTBwPWR3ZLaoso=" -> "AmxD0NqBoxPOvSf5JFSqaUAIXDz03OXzCSpzQszQUkc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "PoJcnVG+YKYdI0f0gEM2+YXIqwxC1fBBJuEhze1cGu8=" -> "dgvJiQowAfOVdxB/I4XMj5dQbEW3CVdUVU4Mr5HyI0k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZXutaqjc+alJuTTMJ4mZ/R92/OTj7Wmq+Au9+t1dHPo=" -> "9hbbUAgIYWs/xM9IHr3cu/ecEBHlgy7NazWfQRZXTFM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "beL+wnKZ2YNJzkhbRdt3vvDTGMQNxASZNtZGrLvaV4s=" -> "UZO2NZFR/3lDTPSh49VBgIWGPMQ7aidPKy0lkfIK+PA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+Oep8s+rgAVQIUjbaAugw6vAhtAXw4aTnZlxxm6CvS8=" -> "eBAwIXbtf1rs954WNWr+Wro1rnCx+dfV16Pj18MIWSc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ec4PTpaTCimyooPR9JGzvjNed6ADmS/aHJxS6lnA0L8=" -> "ttfbIyShLUp9yfEiu2kX2GwW+LUHtF+xjgTbCP1wrRo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "zKnmt3zAr5FtIkeekRvvlbd+zO4+2+UiVvFRrWOuXgw=" -> "nrZsMGQKm/eWcYBAlyg+3kSVLOVDHFiaAoTmUPFAaoU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ascV00k7JSj/eSSURQvDhxaX2heRLYoO15Kzup+ag/E=" -> "gfOP5wKOHfUJUGLTNuh7objN9EjD94isZBZnsznTrrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "EfhGUT3tx76l9IJKs/abdDRcPA7ZoNxuYRn7DWKsOSk=" -> "xkI0SfcvHdTyegA6coQ21MCLVOS5h99AU/LYIaHOW7Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-19T23:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "qIp7vgSENcUGGXoS7BoW7JJmLJvv5BYlYkQRLL0TCRU=" -> "+aGfl0OA7odFmVaLXiMtb0ww5Y959U12jWozrzgspxQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "2TqYioqTAyZd9ByLRnYCtGPxtz3cCOiVTUz4K9QprSM=" -> "i08A2Uw37ibG3Y9dnfvrKFucgqZbvc0mwbzD6E1vaU8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvDN/QIqMRvslk1rzT14LivaplYSwARGwCxpaHkZsXk=" -> "UlyVh+zIGduU0ACcyGVcxw13UL9YpkEPffh8BkHUF/0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "UkKU6G8Iu7SCSEeADvQGTt6DFwRFdClCJ01Hv3R9u4U=" -> "OVHahjX2fcVPGzEk1CIEjAfQWDA+w6PnlRhlfHEKW5g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "6OkfGbruwr2rRZNx4EDL7in1U9yLbhwO0uANc9yHgVc=" -> "hABVE7jhl0XPlkH0zHtqUbFsjoIMch5Nu5vYav8QdX0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hx0mDGJQ8KbYBGGXh+sQggr+ReFQbScbkSVyY2Ux8Fg=" -> "4TvgGurfpjy8nXOn+6zOL6QhSm8V2yN4JoK2Br8S6bs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "16A2pw8nlFTZMRLJmAaX+WwMPMA1m5dWz8O8pS/qp4w=" -> "FnfNaDp56yZu3CuCtr09+3GZ2Pl3leoEQmsC9IysHpo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rNDDl0R1+sp5ZMVYyJyguWE9klc0E/5Qqj1YQ5o78oM=" -> "aBWphmAOv0mIRnI5oDHzsb0e+w7mQ0/Aydu8tBTfqhw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpgbDZeyoeDYVdL1ThTTXBSnRmWot7tMnJEL33edENA=" -> "wNDiLA1PpY6BBzjAyAMR+mYHzQOkN+4wkv+I4phej1c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rkNrxroIb5+pGcT/5abm2Zz5zByodb5483DnrG62kTM=" -> "jrYPhQ9bB3X5dG6pTK9mmzr1hntYIqs+0s/LyvYiwuU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "k0N7bTzCsWIFRXUEHAi10mmM2OGGi3KuL48YMwHHUAY=" -> "jm3wmLQ5OXb1HBf72q91Nu/tBMtg06HmsrEpI5QZuhY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "lrD03TZ5x+IRsQcP/qO7UX88DflVWTCL6QyciOg1ywk=" -> "pTwPTK+/guBQLCrlI012FRxLQB4pqIlJw5Hd/xt7pUg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOtYEOP7d/6pXABh8Xkzd5nBlNk/bTD8eM+Cf2ZnJYo=" -> "8YveUY8/ENmQT2yiOBUsGsvU5dH5UaEpbGNMJ1CcVqA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LzMBXltqcyzSOSK6aaUGlcZmCwhZt0ZEKV9futc3Iy8=" -> "svCvoE3Y+1uAT9kcRuZiaD5taLWEdyE4nCVs+qoX3w0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBYY3VO5AIx9u3oeHyX8prTXubkDk3qzb4Xa7iF65zI=" -> "4+e2JyBMUBikZ9qyn1WQ0hFjCsz+5zSV4sOALUxW04o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9rNSPL3EkWYHmivfnK6J2q6H7BTNlns3mRGIUTRyE+E=" -> "lcjPU/QnOQivZf4qyHAAwe5jhedhdkXmv5zLZ1tVzWw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPTtZ/MMAyh8Wt0k4XVAvond94ke04WfNQazPOPu10I=" -> "UjUrOMvtF7iq6mP73nSGaSg3V+dKPLwwP2i4O1fFeH8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YlSya3dSMroenMmJmokC1/bsZ51e6fR/ZJbnCJvkN9A=" -> "pcEjQjnBiD7P0vGL2zUnSLDi9y+29S64Fn/qA6gi5lQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tcl/oaKuGRC8nEcSY+InRV+ZP2OBn6RB2wGeO7c91xg=" -> "6p1aSnrIzOE0e/XZRxvGwYZfFP+cZqTP+Y+gwEEjIK4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-12T21:12:02Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "dk0err" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-12T21:12:01Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-12T21:12:00Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*